tap "1password/tap"
tap "altinity/clickhouse"
tap "candid82/brew"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "qmk/qmk"
tap "ttscoff/thelab"
tap "yqrashawn/goku"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Shell extension to jump to frequently used directories
brew "autojump"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Free analytics DBMS for big data with SQL interface
brew "clickhouse@22.3", link: true
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Text processing system for reStructuredText
brew "docutils"
# Debian package management system
brew "dpkg"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# More intuitive version of du in rust
brew "dust"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# macOS CLI for managing custom icons for files and folders
brew "fileicon"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Audit git repos for secrets
brew "gitleaks"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Open-source GitLab command-line tool
brew "glab"
# Render markdown on the CLI
brew "glow"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Image processing tools collection
brew "graphicsmagick"
# GNU troff text-formatting system
brew "groff"
# Tool for glamorous shell scripts
brew "gum"
# Free Kerberos 5 implementation
brew "heimdal"
# Process manager for Procfile-based applications
brew "hivemind"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Tool to report network interface bandwidth
brew "ifstat"
# Interactive JSON filter using jq
brew "jnv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Helps you navigate your file system faster by learning your habits
brew "jump"
# Simple terminal UI for git commands
brew "lazygit"
# Conversion library
brew "libiconv"
# Postgres C API library
brew "libpq"
# YAML Parser
brew "libyaml"
# Parsing Expression Grammars For Lua
brew "lpeg"
# Fast, async, resource-friendly link checker
brew "lychee"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage compile and link flags for libraries
brew "pkg-config"
# Install NodeJS versions
brew "node-build"
# Trigger notifications when a process completes
brew "noti"
# Modern shell for the GitHub era
brew "nushell"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Object-relational database system
brew "postgresql@12", restart_service: true
# Object-relational database system
brew "postgresql@13"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Prevent committing secret keys into your source code
brew "ripsecrets"
# Install various Ruby versions and implementations
brew "ruby-build"
# Collection of tools for managing UNIX services
brew "runit"
# Small command-line utility for adding spacers to command output
brew "spacer"
# Modern SSH server for teams managing distributed infrastructure
brew "teleport"
# Simplified and community-driven man pages
brew "tldr"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Syntax-aware linter for prose
brew "vale"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Readability and Markdown utility for saving web urls and HTML text
brew "ttscoff/thelab/gather-cli"
# karabiner configurator
brew "yqrashawn/goku/goku"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Menu bar icon organiser
cask "bartender"
# Allows switching between application windows
cask "contexts"
# API documentation browser and code snippet manager
cask "dash"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Screen colour temperature controller
cask "flux"
# Website and application blocker
cask "focus"
cask "font-caskaydia-cove-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-noto-sans-arabic"
cask "font-sf-pro"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# iPhone management application
cask "imazing"
# System monitoring app
cask "istat-menus"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# Noise cancelling application
cask "krisp"
# Host-based application firewall
cask "little-snitch"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# Open-source software for live streaming and screen recording
cask "obs"
# Automatic time tracker
cask "qbserve"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Kubernetes and container management on the desktop
cask "rancher"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Team communication and collaboration software
cask "slack"
# Native GUI tool for relational databases
cask "tableplus"
# Messaging app with a focus on speed and security
cask "telegram"
# Pomodoro desktop timer
cask "tomighty"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# View output from scripts in the menu bar
cask "xbar"
mas "Actions", id: 1586435171
mas "Be Focused Pro", id: 961632517
mas "Bear", id: 1091189122
mas "BrightIntosh", id: 6452471855
mas "ColorSlurp", id: 1287239339
mas "Command X", id: 6448461551
mas "Dark Noise", id: 1465439395
mas "Dato", id: 1470584107
mas "Day One", id: 1055511498
mas "Day Progress", id: 6450280202
mas "Drafts", id: 1435957248
mas "Goodnotes", id: 1444383602
mas "Hand Mirror", id: 1502839586
mas "HP Smart", id: 1474276998
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LanguageTool", id: 1534275760
mas "Lungo", id: 1263070803
mas "NordLayer", id: 1488888843
mas "Numbers", id: 409203825
mas "One Thing", id: 1604176982
mas "Pages", id: 409201541
mas "Peek", id: 1554235898
mas "Session", id: 1521432881
mas "Todoist", id: 585829637
mas "Velja", id: 1607635845
mas "Xcode", id: 497799835
mas "Xmind", id: 1327661892
vscode "arcticicestudio.nord-visual-studio-code"
vscode "castwide.solargraph"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "equinusocio.vsc-community-material-theme"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "gitlab.gitlab-workflow"
vscode "isudox.vscode-jetbrains-keybindings"
vscode "jdinhlife.gruvbox"
vscode "kaiwood.endwise"
vscode "mikestead.dotenv"
vscode "noku.rails-run-spec-vscode"
vscode "octref.vetur"
vscode "orta.vscode-jest"
vscode "rebornix.ruby"
vscode "shopify.ruby-lsp"
vscode "vayan.haml"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "vue.vscode-typescript-vue-plugin"
vscode "wingrunr21.vscode-ruby"
vscode "yzhang.markdown-all-in-one"
