tap "1password/tap"
tap "altinity/clickhouse"
tap "arl/arl"
tap "candid82/brew"
tap "felixkratz/formulae"
tap "fforster/gitlab-mcp", "https://gitlab.com/fforster/homebrew-gitlab-mcp.git"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jorgerojas26/lazysql"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "yqrashawn/goku"
# Code searching, linting, rewriting
brew "ast-grep"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Linter/analyzer for Makefiles
brew "checkmake"
# Free analytics DBMS for big data with SQL interface
brew "clickhouse@22.3", link: true
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Postgres C API library
brew "libpq"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Text processing system for reStructuredText
brew "docutils"
# Debian package management system
brew "dpkg"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# More intuitive version of du in rust
brew "dust"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# macOS CLI for managing custom icons for files and folders
brew "fileicon"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Audit git repos for secrets
brew "gitleaks"
# Open-source GitLab command-line tool
brew "glab"
# Render markdown on the CLI
brew "glow"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Image processing tools collection
brew "graphicsmagick"
# GNU troff text-formatting system
brew "groff"
# Tool for glamorous shell scripts
brew "gum"
# Free Kerberos 5 implementation
brew "heimdal"
# Process manager for Procfile-based applications
brew "hivemind"
# Fast and powerful log viewer and processor
brew "hl"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Tool to report network interface bandwidth
brew "ifstat"
# Interactive JSON filter using jq
brew "jnv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Helps you navigate your file system faster by learning your habits
brew "jump"
# Simple terminal UI for git commands
brew "lazygit"
# Cross-platform TUI database management tool
brew "lazysql"
# Conversion library
brew "libiconv"
# YAML Parser
brew "libyaml"
# Parsing Expression Grammars For Lua
brew "lpeg"
# Powerful, lightweight programming language
brew "lua"
# Fast, async, resource-friendly link checker
brew "lychee"
# Mac App Store command-line interface
brew "mas"
# Small build system for use with gyp or CMake
brew "ninja"
# Fast and user friendly build system
brew "meson"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# No Nonsense Neovim Client in Rust
brew "neovide"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Install NodeJS versions
brew "node-build"
# Trigger notifications when a process completes
brew "noti"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Object-relational database system
brew "postgresql@12", restart_service: :changed
# Object-relational database system
brew "postgresql@13"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Prevent committing secret keys into your source code
brew "ripsecrets"
# Install various Ruby versions and implementations
brew "ruby-build"
# Collection of tools for managing UNIX services
brew "runit"
# Small command-line utility for adding spacers to command output
brew "spacer"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Modern SSH server for teams managing distributed infrastructure
brew "teleport"
# Simplified and community-driven man pages
brew "tldr"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Syntax-aware linter for prose
brew "vale"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Git in your tmux status bar.
brew "arl/arl/gitmux"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# A Model Context Protocol (MCP) server for GitLab, enabling Claude to interact directly with your GitLab instance.
brew "fforster/gitlab-mcp/gitlab-mcp"
# karabiner configurator
brew "yqrashawn/goku/goku"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Menu bar icon organiser
cask "bartender"
# Allows switching between application windows
cask "contexts"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Screen colour temperature controller
cask "flux-app"
# Website and application blocker
cask "focus"
cask "font-0xproto"
cask "font-cascadia-mono"
cask "font-cascadia-mono-nf"
cask "font-fira-code"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans-arabic"
cask "font-intel-one-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-sans-arabic"
cask "font-noto-sans-arabic-ui"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-sf-pro"
cask "font-sn-pro"
cask "font-vazirmatn"
# GIT client
cask "fork"
# iPhone management application
cask "imazing"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# Custom Discord client
cask "legcord"
# Host-based application firewall
cask "little-snitch"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# Open-source software for live streaming and screen recording
cask "obs"
# Automatic time tracker
cask "qbserve"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Kubernetes and container management on the desktop
cask "rancher"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Team communication and collaboration software
cask "slack"
# Native GUI tool for relational databases
cask "tableplus"
# Messaging app with a focus on speed and security
cask "telegram"
# Multimedia player
cask "vlc"
