tap "1password/tap"
tap "altinity/clickhouse"
tap "candid82/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jdxcode/tap"
tap "oven-sh/bun"
tap "ttscoff/thelab"
tap "yqrashawn/goku"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage compile and link flags for libraries
brew "pkg-config"
# Free analytics DBMS for big data with SQL interface
brew "clickhouse@22.3", link: true
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Text processing system for reStructuredText
brew "docutils"
# Debian package management system
brew "dpkg"
# More intuitive version of du in rust
brew "dust"
# Modern replacement for 'ls'
brew "exa"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Audit git repos for secrets
brew "gitleaks"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Open-source GitLab command-line tool
brew "glab"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Image processing tools collection
brew "graphicsmagick"
# Free Kerberos 5 implementation
brew "heimdal"
# Process manager for Procfile-based applications
brew "hivemind"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Helps you navigate your file system faster by learning your habits
brew "jump"
# Simple terminal UI for git commands
brew "lazygit"
# Conversion library
brew "libiconv"
# Postgres C API library
brew "libpq"
# YAML Parser
brew "libyaml"
# Parsing Expression Grammars For Lua
brew "lpeg"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Install NodeJS versions
brew "node-build"
# Trigger notifications when a process completes
brew "noti"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Object-relational database system
brew "postgresql@12", restart_service: true
# Object-relational database system
brew "postgresql@13"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Prevent committing secret keys into your source code
brew "ripsecrets"
# Install various Ruby versions and implementations
brew "ruby-build"
# Collection of tools for managing UNIX services
brew "runit"
# Modern SSH server for teams managing distributed infrastructure
brew "teleport"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Syntax-aware linter for prose
brew "vale"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Multi-language runtime manager
brew "jdxcode/tap/rtx"
# Readability and Markdown utility for saving web urls and HTML text
brew "ttscoff/thelab/gather-cli"
# karabiner configurator
brew "yqrashawn/goku/goku"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Menu bar icon organizer
cask "bartender"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Allows switching between application windows
cask "contexts"
# Calendar for professionals and teams
cask "cron"
# API documentation browser and code snippet manager
cask "dash"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Screen color temperature controller
cask "flux"
# Website and application blocker
cask "focus"
# Developer targeted fonts with a high number of glyphs
cask "font-caskaydia-cove-nerd-font"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Superfamily of fonts for code
cask "font-monaspace"
cask "font-noto-sans-arabic"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# iPhone management application
cask "imazing"
# System monitoring app
cask "istat-menus"
# Keyboard customizer
cask "karabiner-elements"
# Automation software
cask "keyboard-maestro"
# Open-source keystroke visualizer
cask "keycastr"
# Noise cancelling application
cask "krisp"
# Host-based application firewall
cask "little-snitch"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# Automatic time tracker
cask "qbserve"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Emoji picker optimized for blind people
cask "rocket"
# Ruby on Rails IDE
cask "rubymine"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# Messaging app with a focus on speed and security
cask "telegram"
# Pomodoro desktop timer
cask "tomighty"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# View output from scripts in the menu bar
cask "xbar"
mas "Actions", id: 1586435171
mas "AdGuard for Safari", id: 1440147259
mas "Be Focused Pro", id: 961632517
mas "Bear", id: 1091189122
mas "ColorSlurp", id: 1287239339
mas "Command X", id: 6448461551
mas "Dark Noise", id: 1465439395
mas "Day One", id: 1055511498
mas "Day Progress", id: 6450280202
mas "Drafts", id: 1435957248
mas "GIPHY CAPTURE", id: 668208984
mas "Goodnotes", id: 1444383602
mas "Hand Mirror", id: 1502839586
mas "HP Smart", id: 1474276998
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LanguageTool", id: 1534275760
mas "Lungo", id: 1263070803
mas "NordLayer", id: 1488888843
mas "Numbers", id: 409203825
mas "One Thing", id: 1604176982
mas "Pages", id: 409201541
mas "Peek", id: 1554235898
mas "Session", id: 1521432881
mas "Todoist", id: 585829637
mas "Velja", id: 1607635845
mas "Xcode", id: 497799835
vscode "arcticicestudio.nord-visual-studio-code"
vscode "castwide.solargraph"
vscode "Catppuccin.catppuccin-vsc"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "Equinusocio.vsc-community-material-theme"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "GitLab.gitlab-workflow"
vscode "isudox.vscode-jetbrains-keybindings"
vscode "jdinhlife.gruvbox"
vscode "kaiwood.endwise"
vscode "mikestead.dotenv"
vscode "noku.rails-run-spec-vscode"
vscode "octref.vetur"
vscode "Orta.vscode-jest"
vscode "rebornix.ruby"
vscode "Shopify.ruby-lsp"
vscode "vayan.haml"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "wingrunr21.vscode-ruby"
vscode "yzhang.markdown-all-in-one"
