zsh-users/zsh-completions
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
# zdharma/fast-syntax-highlighting
zsh-users/zsh-syntax-highlighting
mafredri/zsh-async
sindresorhus/pure
# bhilburn/powerlevel9k
lukechilds/zsh-nvm
# romkatv/powerlevel10k
djui/alias-tips
# hlissner/zsh-autopair
# tysonwolker/iterm-tab-colors # this one might be slow
# sobolevn/wakatime-zsh-plugin

robbyrussell/oh-my-zsh path:plugins/git
# robbyrussell/oh-my-zsh path:plugins/composer
robbyrussell/oh-my-zsh path:plugins/node
robbyrussell/oh-my-zsh path:plugins/brew
# robbyrussell/oh-my-zsh path:plugins/colorize
# robbyrussell/oh-my-zsh path:plugins/docker
# robbyrussell/oh-my-zsh path:plugins/docker-compose
# tomsquest/nvm-auto-use.zsh
# desyncr/auto-ls
