jorgebucaran/fisher
catppuccin/fish
patrickf1/fzf.fish
jorgebucaran/autopair.fish
gazorby/fish-abbreviation-tips
meaningful-ooo/sponge
paysonwallach/fish-you-should-use
nickeb96/puffer-fish
pure-fish/pure
acomagu/fish-async-prompt
